# Pandas - Read

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
dataframe = pd.read_csv("ex1.csv")

In [4]:
dataframe

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
dataframe["message"]

0    hello
1    world
2      foo
Name: message, dtype: object

In [8]:
type(dataframe["message"])

pandas.core.series.Series

In [9]:
type(dataframe[["message"]])

pandas.core.frame.DataFrame

In [10]:
dataframe[["message","a"]]

  message  a
0   hello  1
1   world  5
2     foo  9

In [13]:
df1 = dataframe[["message","a","b","c","d"]]

In [14]:
df1

  message  a   b   c   d
0   hello  1   2   3   4
1   world  5   6   7   8
2     foo  9  10  11  12

In [15]:
df = pd.read_csv("ex2.csv")

In [16]:
df

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [17]:
df = pd.read_csv("ex2.csv",header = None)

In [18]:
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [19]:
df = pd.read_csv("ex2.csv",header = None, names = ["ironman","shaktiman","g","h","thor"])

In [20]:
df

   ironman  shaktiman   g   h   thor
0        1          2   3   4  hello
1        5          6   7   8  world
2        9         10  11  12    foo